{"html": {"body": {"document": {"sentences": {"sentence": [{"@id": "1", "text": "﻿Developer Agreement and Policy\n\nDeveloper Agreement¶\n\nEffective: November 3, 2017.", "avg": "7.33"}, {"@id": "2", "text": "This Twitter Developer Agreement (“Agreement”) is made between you (either an\nindividual or an entity, referred to herein as “you”) and Twitter, Inc. and\nTwitter International Company (collectively, “Twitter”) and governs your access\nto and use of the Licensed Material (as defined below).", "avg": "5.36"}, {"@id": "3", "text": "PLEASE READ THE TERMS AND CONDITIONS OF THIS AGREEMENT CAREFULLY, INCLUDING\nWITHOUT LIMITATION ANY LINKED TERMS AND CONDITIONS APPEARING OR REFERENCED\nBELOW, WHICH ARE HEREBY MADE PART OF THIS LICENSE AGREEMENT.", "avg": "5.74"}, {"@id": "4", "text": "BY USING THE\nLICENSED MATERIAL, YOU ARE AGREEING THAT YOU HAVE READ, AND THAT YOU AGREE TO\nCOMPLY WITH AND TO BE BOUND BY THE TERMS AND CONDITIONS OF THIS AGREEMENT AND\nALL APPLICABLE LAWS AND REGULATIONS IN THEIR ENTIRETY WITHOUT LIMITATION OR\nQUALIFICATION.", "avg": "4.84"}, {"@id": "5", "text": "IF YOU DO NOT AGREE TO BE BOUND BY THIS AGREEMENT, THEN YOU MAY\nNOT ACCESS OR OTHERWISE USE THE LICENSED MATERIAL.", "avg": "4.14"}, {"@id": "6", "text": "THIS AGREEMENT IS EFFECTIVE\nAS OF THE FIRST DATE THAT YOU USE THE LICENSED MATERIAL (“EFFECTIVE DATE”).", "avg": "4.82"}, {"@id": "7", "text": "IF YOU ARE AN INDIVIDUAL REPRESENTING AN ENTITY, YOU ACKNOWLEDGE THAT YOU HAVE\nTHE APPROPRIATE AUTHORITY TO ACCEPT THIS AGREEMENT ON BEHALF OF SUCH ENTITY.", "avg": "5.16"}, {"@id": "8", "text": "YOU MAY NOT USE THE LICENSED MATERIAL AND MAY NOT ACCEPT THIS AGREEMENT IF YOU\nARE NOT OF LEGAL AGE TO FORM A BINDING CONTRACT WITH TWITTER, OR YOU ARE BARRED\nFROM USING OR RECEIVING THE LICENSED MATERIAL UNDER APPLICABLE LAW.", "avg": "4.49"}, {"@id": "9", "text": "I. Twitter API and Twitter Content¶\n\nA. Definitions\n\n 1.", "avg": "6.2"}, {"@id": "10", "text": "Content ‒ Tweets, Tweet IDs, Twitter end user profile information,\nPeriscope Broadcasts, Broadcast IDs and any other data and information made\navailable to you through the Twitter API or by any other means authorized\nby Twitter, and any copies and derivative works thereof.", "avg": "5.33"}, {"@id": "11", "text": "2.", "avg": "0"}, {"@id": "12", "text": "Broadcast ID - A unique identification number generated for each Periscope\nBroadcast.", "avg": "6.55"}, {"@id": "13", "text": "3.", "avg": "0"}, {"@id": "14", "text": "Developer Site ‒ Twitter’s developer site located at https://\ndeveloper.twitter.com.", "avg": "5.33"}, {"@id": "15", "text": "4.", "avg": "0"}, {"@id": "16", "text": "End Users ‒ Users of your Services, who are bound to enforceable service\nterms with you.", "avg": "4.67"}, {"@id": "17", "text": "5.", "avg": "0"}, {"@id": "18", "text": "Licensed Material ‒ A collective term for the Twitter API and Content.", "avg": "5.18"}, {"@id": "19", "text": "6.", "avg": "0"}, {"@id": "20", "text": "Periscope Broadcast - A live or on-demand video stream that is publicly\ndisplayed on Twitter Services and is generated by a user via Twitter’s\nPeriscope Producer feature (as set forth at https://help.periscope.tv/\ncustomer/en/portal/articles/2600293).", "avg": "4.81"}, {"@id": "21", "text": "7.", "avg": "0"}, {"@id": "22", "text": "Services ‒ Your websites, applications and other offerings that display\nContent or otherwise use the Licensed Material approved by Twitter through\nany onboarding process.", "avg": "6.26"}, {"@id": "23", "text": "8.", "avg": "0"}, {"@id": "24", "text": "Tweet ID ‒ A unique identification number generated for each Tweet.", "avg": "5.5"}, {"@id": "25", "text": "9.", "avg": "0"}, {"@id": "26", "text": "Tweet ‒ a short-form text and/or multimedia-based posting made on Twitter\nServices.", "avg": "4.75"}, {"@id": "27", "text": "10.", "avg": "0"}, {"@id": "28", "text": "Direct Message - A text and/or multimedia-based posting that is privately\nsent on the Twitter Service by one end user to one or more specific end\nuser(s).", "avg": "4.08"}, {"@id": "29", "text": "11.", "avg": "0"}, {"@id": "30", "text": "Twitter API ‒ The Twitter Application Programming Interface (“API”),\nSoftware Development Kit (“SDK”) and/or the related documentation, data,\ncode, and other materials provided by Twitter with the API, as updated from\ntime to time, including without limitation through the Developer Site.", "avg": "5.79"}, {"@id": "31", "text": "12.", "avg": "0"}, {"@id": "32", "text": "Twitter Marks ‒ The Twitter name, or logos that Twitter makes available to\nyou, including via the Developer Site.", "avg": "5.06"}, {"@id": "33", "text": "13.", "avg": "0"}, {"@id": "34", "text": "Twitter Services ‒ Twitter’s offerings and platforms, including without\nlimitation, those offered via http://twitter.com and Twitter’s mobile\napplication.", "avg": "6.16"}, {"@id": "35", "text": "B.", "avg": "1.0"}, {"@id": "36", "text": "License from Twitter.", "avg": "6.0"}, {"@id": "37", "text": "Subject to the terms and conditions in this Agreement\n(as a condition to the grant below), Twitter hereby grants you and you accept a\nnon-exclusive, royalty free, non-transferable, non-sublicensable, revocable\nlicense during the Term solely to:\n\n 1.", "avg": "4.7"}, {"@id": "38", "text": "Use the Twitter API to integrate Content into your Services or conduct\nanalysis of such Content;\n 2.", "avg": "5.0"}, {"@id": "39", "text": "Copy a reasonable amount of and display the Content on and through your\nServices to End Users, as permitted by this Agreement;\n 3.", "avg": "4.68"}, {"@id": "40", "text": "Modify Content only to format it for display on your Services; and\n 4.", "avg": "4.5"}, {"@id": "41", "text": "Use and display Twitter Marks, solely to attribute Twitter’s offerings as\nthe source of the Content, as set forth herein.", "avg": "4.67"}, {"@id": "42", "text": "C. License to Twitter You hereby grant Twitter and Twitter accepts a\nnon-exclusive, royalty free, non-transferable, non-sublicensable revocable\nlicense during the Term to access, index, and cache by any means, including web\nspiders and/or crawlers, any webpage on which you display Content using\nembedded Tweets or embedded timelines.", "avg": "5.23"}, {"@id": "43", "text": "D. Incorporated Terms.", "avg": "8.5"}, {"@id": "44", "text": "Your use of the Licensed Material is further subject to\nand governed by the following terms and conditions:\n\n 1. the Twitter Developer Policy located at https://developer.twitter.com/en/\ndeveloper-terms/policy (“Developer Policy”);\n 2. as it relates to your display of any of the Content, the Display\nRequirements located at https://developer.twitter.com/en/developer-terms/\ndisplay-requirements (“Display Requirements”);\n 3. as it relates to your use and display of the Twitter Marks, the Twitter\nBrand Assets and Guidelines located at https://twitter.com/logo and https:/\n/www.periscope.tv/trademarkpolicy (“Brand Guidelines”); and\n 4. as it relates to taking automated actions on your account, the Automation\nRules located at https://support.twitter.com/articles/76915 (“Automation\nRules”).", "avg": "5.06"}, {"@id": "45", "text": "The Developer Policy, Display Requirements, Brand Guidelines, and Automation\nRules are collectively referred to herein as the “Developer Terms”.", "avg": "6.32"}, {"@id": "46", "text": "You agree\nto the Developer Terms, which are hereby incorporated by reference and are\navailable in hardcopy upon request to Twitter.", "avg": "5.19"}, {"@id": "47", "text": "In the event of a conflict\nbetween the Developer Terms and this Agreement, this Agreement shall control.", "avg": "5.06"}, {"@id": "48", "text": "None of the Developer Terms expand or extend the license to the Twitter API,\nContent or Twitter Marks granted in this Agreement.", "avg": "4.77"}, {"@id": "49", "text": "II.", "avg": "2.0"}, {"@id": "50", "text": "Restrictions on Use of Licensed Materials¶\n\n A.", "avg": "4.67"}, {"@id": "51", "text": "Reverse Engineering and other Limitations.", "avg": "7.4"}, {"@id": "52", "text": "You will not or attempt to (and\nwill not allow others to) 1) reverse engineer, decompile, disassemble or\ntranslate the Twitter API, or otherwise attempt to derive source code,\ntrade secrets or know-how in or underlying any Twitter API or any portion\nthereof; 2) interfere with, modify, disrupt or disable features or\nfunctionality of the Twitter API, including without limitation any such\nmechanism used to restrict or control the functionality, or defeat, avoid,\nbypass, remove, deactivate or otherwise circumvent any software protection\nor monitoring mechanisms of the Twitter API; 3) sell, rent, lease,\nsublicense, distribute, redistribute, syndicate, create derivative works\nof, assign or otherwise transfer or provide access to, in whole or in part,\nthe Licensed Material to any third party except as expressly permitted\nherein; 4) provide use of the Twitter API on a service bureau, rental or\nmanaged services basis or permit other individuals or entities to create\nlinks to the Twitter API or \"frame\" or \"mirror\" the Twitter API on any\nother server, or wireless or Internet-based device, or otherwise make\navailable to a third party, any token, key, password or other login\ncredentials to the Twitter API; or 5) use the Licensed Material for any\nillegal, unauthorized or other improper purposes.", "avg": "5.18"}, {"@id": "53", "text": "B.", "avg": "1.0"}, {"@id": "54", "text": "Rate Limits.", "avg": "5.0"}, {"@id": "55", "text": "You will not attempt to exceed or circumvent limitations on\naccess, calls and use of the Twitter API (\"Rate Limits\"), or otherwise use\nthe Twitter API in a manner that exceeds reasonable request volume,\nconstitutes excessive or abusive usage, or otherwise fails to comply or is\ninconsistent with any part of this Agreement.", "avg": "4.94"}, {"@id": "56", "text": "If you exceed or Twitter\nreasonably believes that you have attempted to circumvent Rate Limits,\ncontrols to limit use of the Twitter APIs or the terms and conditions of\nthis Agreement, then your ability to use the Licensed Materials may be\ntemporarily suspended or permanently blocked.", "avg": "5.15"}, {"@id": "57", "text": "Twitter may monitor your use\nof the Twitter API to improve the Twitter Service and to ensure your\ncompliance with this Agreement.", "avg": "4.86"}, {"@id": "58", "text": "C. Geographic Data.", "avg": "7.0"}, {"@id": "59", "text": "Your license to use Content in this Agreement does not\nallow you to (and you will not allow others to) aggregate, cache, or store\nlocation data and other geographic information contained in the Content,\nexcept in conjunction with the Content to which it is attached.", "avg": "4.8"}, {"@id": "60", "text": "Your\nlicense only allows you to use such location data and geographic\ninformation to identify the location tagged by the Content.", "avg": "5.14"}, {"@id": "61", "text": "Any use of\nlocation data or geographic information on a standalone basis or beyond the\nlicense granted herein is a breach of this Agreement.", "avg": "4.83"}, {"@id": "62", "text": "D. Use of Twitter Marks.", "avg": "4.25"}, {"@id": "63", "text": "The Twitter Marks may not be included in or as part\nof your registered corporate name, any of your logos, or any of your\nservice or product names.", "avg": "4.14"}, {"@id": "64", "text": "Moreover, you may not create any derivative works\nof the Twitter Marks or use the Twitter Marks in a manner that creates or\nreasonably implies an inaccurate sense of endorsement, sponsorship, or\nassociation with Twitter.", "avg": "5.2"}, {"@id": "65", "text": "You will not otherwise use business names and/or\nlogos in a manner that can mislead, confuse, or deceive users of your\nServices.", "avg": "4.67"}, {"@id": "66", "text": "All use of the Twitter Marks and all goodwill arising out of such\nuse, will inure to Twitter's benefit.", "avg": "4.26"}, {"@id": "67", "text": "You shall not use the Twitter Marks\nexcept as expressly authorized herein without Twitter's prior consent.", "avg": "5.5"}, {"@id": "68", "text": "You\nwill not remove or alter any proprietary notices or Twitter Marks on the\nLicensed Material.", "avg": "4.94"}, {"@id": "69", "text": "III.", "avg": "3.0"}, {"@id": "70", "text": "Updates¶\n\nYou acknowledge that Twitter may update or modify the Twitter APIs from time to\ntime, and at its sole discretion (in each instance, an “Update”).", "avg": "4.56"}, {"@id": "71", "text": "You are\nrequired to implement and use the most current version of the Twitter API and\nto make any changes to your Services that are required as a result of such\nUpdate, at your sole cost and expense.", "avg": "4.21"}, {"@id": "72", "text": "Updates may adversely affect the manner\nin which your Services access or communicate with the Twitter API or display\nContent.", "avg": "5.25"}, {"@id": "73", "text": "Your continued access or use of the Twitter APIs following an update\nor modification will constitute binding acceptance of the Update.", "avg": "5.38"}, {"@id": "74", "text": "IV.", "avg": "2.0"}, {"@id": "75", "text": "Ownership and Feedback¶\n\n A.", "avg": "4.33"}, {"@id": "76", "text": "Ownership.", "avg": "9.0"}, {"@id": "77", "text": "The Licensed Materials are licensed, not sold, and Twitter\nretains and reserves all rights not expressly granted in this Agreement.", "avg": "5.45"}, {"@id": "78", "text": "You expressly acknowledge that Twitter, its licensors and its end users\nretain all worldwide right, title and interest in and to the Licensed\nMaterial and Content, including all rights in patents, trademarks, trade\nnames, copyrights, trade secrets, know-how, data (including all\napplications therefor), and all proprietary rights under the laws of the\nUnited States, any other jurisdiction or any treaty (\"IP Rights\").", "avg": "5.43"}, {"@id": "79", "text": "You\nagree not to do anything inconsistent with such ownership, including\nwithout limitation, challenging Twitter’s ownership of the Twitter Marks,\nchallenging the validity of the licenses granted herein, or otherwise\ncopying or exploiting the Twitter Marks during or after the termination of\nthis Agreement, except as specifically authorized herein.", "avg": "5.88"}, {"@id": "80", "text": "If you acquire\nany rights in the Twitter Marks or any confusingly similar marks, by\noperation of law or otherwise, you will, at no expense to Twitter,\nimmediately assign such rights to Twitter.", "avg": "4.73"}, {"@id": "81", "text": "B.", "avg": "1.0"}, {"@id": "82", "text": "Feedback.", "avg": "8.0"}, {"@id": "83", "text": "You may provide Twitter with comments concerning the Licensed\nMaterial, Services or your evaluation and use thereof (collectively, \"\nFeedback\").", "avg": "6.21"}, {"@id": "84", "text": "You hereby grant Twitter all rights, title and ownership of\nsuch Feedback (including all intellectual property rights therein), and\nTwitter may use the Feedback for any and all commercial and non-commercial\npurposes with no obligation of any kind to you.", "avg": "5.03"}, {"@id": "85", "text": "V. Termination¶\n\nTwitter may immediately terminate or suspend this Agreement, any rights granted\nherein, and/or your license to the Licensed Materials, at its sole discretion\nat any time, for any reason by providing notice to you.", "avg": "5.12"}, {"@id": "86", "text": "You may terminate this\nAgreement at any time by ceasing your access to the Twitter API and use of all\nTwitter Content.", "avg": "4.36"}, {"@id": "87", "text": "Upon termination of this Agreement, all licenses granted\nherein immediately expire and you must cease use of all Licensed Materials.", "avg": "5.55"}, {"@id": "88", "text": "The\nparties to this Agreement will not be liable to each other for any damages\nresulting solely from termination of this Agreement as permitted under this\nAgreement.", "avg": "5.11"}, {"@id": "89", "text": "Sections II, IV, V, VI and VII of this Agreement will survive the\ntermination of this Agreement.", "avg": "4.47"}, {"@id": "90", "text": "VI.", "avg": "2.0"}, {"@id": "91", "text": "Confidentiality¶\n\nYou may be given access to certain non-public information, software, and\nspecifications relating to the Licensed Material (“Confidential Information”),\nwhich is confidential and proprietary to Twitter.", "avg": "6.32"}, {"@id": "92", "text": "You may use this Confidential\nInformation only as necessary in exercising your rights granted in this\nAgreement.", "avg": "5.59"}, {"@id": "93", "text": "You may not disclose any of this Confidential Information to any\nthird party without Twitter’s prior written consent.", "avg": "5.16"}, {"@id": "94", "text": "You agree that you will\nprotect this Confidential Information from unauthorized use, access, or\ndisclosure in the same manner that you would use to protect your own\nconfidential and proprietary information of a similar nature and in no event\nwith less than a reasonable degree of care.", "avg": "5.02"}, {"@id": "95", "text": "VII.", "avg": "3.0"}, {"@id": "96", "text": "Other Important Terms¶\n\n A.", "avg": "5.0"}, {"@id": "97", "text": "User Protection.", "avg": "7.0"}, {"@id": "98", "text": "Twitter Content, and information derived from Twitter\nContent, may not be used by, or knowingly displayed, distributed, or\notherwise made available to:\n 1. any public sector entity (or any entities providing services to such\nentities) for surveillance purposes, including but not limited to:\n a. investigating or tracking Twitter's users or their Content; and,\n b. tracking, alerting, or other monitoring of sensitive events\n(including but not limited to protests, rallies, or community\norganizing meetings);\n 2. any public sector entity (or any entities providing services to such\nentities) whose primary function or mission includes conducting\nsurveillance or gathering intelligence;\n 3. any entity for the purposes of conducting or providing surveillance,\nanalyses or research that isolates a group of individuals or any single\nindividual for any unlawful or discriminatory purpose or in a manner\nthat would be inconsistent with our users' reasonable expectations of\nprivacy;\n 4. any entity to target, segment, or profile individuals based on health\n(including pregnancy), negative financial status or condition,\npolitical affiliation or beliefs, racial or ethnic origin, religious or\nphilosophical affiliation or beliefs, sex life or sexual orientation,\ntrade union membership, data relating to any alleged or actual\ncommission of a crime, or any other sensitive categories of personal\ninformation prohibited by law;\n 5. any entity that you reasonably believe will use such data to violate\nthe Universal Declaration of Human Rights (located at http://www.un.org\n/en/documents/udhr/), including without limitation Articles 12, 18, or\n19.", "avg": "5.78"}, {"@id": "99", "text": "If law enforcement personnel request information about Twitter or its users\nfor the purposes of an ongoing investigation, you must refer them to\nTwitter's Guidelines for Law Enforcement located at https://t.co/le.", "avg": "5.45"}, {"@id": "100", "text": "B.", "avg": "1.0"}, {"@id": "101", "text": "Additional Terms for Permitted Government Use.", "avg": "6.67"}, {"@id": "102", "text": "The Twitter API and Twitter\nContent are \"commercial items\" as that term is defined at 48 C.F.R.", "avg": "4.6"}, {"@id": "103", "text": "2.101,\nconsisting of \"commercial computer software\" and \"commercial computer\nsoftware documentation\" as such terms are used in 48 C.F.R.", "avg": "6.25"}, {"@id": "104", "text": "12.212.", "avg": "0"}, {"@id": "105", "text": "Any\nuse, modification, derivative, reproduction, release, performance, display,\ndisclosure or distribution of the Twitter API or Twitter Content by any\ngovernment entity is prohibited, except as expressly permitted by the terms\nof this Agreement.", "avg": "6.0"}, {"@id": "106", "text": "Additionally, any use by U.S. government entities must\nbe in accordance with 48 C.F.R.", "avg": "5.45"}, {"@id": "107", "text": "12.212 and 48 C.F.R.", "avg": "3.0"}, {"@id": "108", "text": "227.7202-1 through\n227.7202-4.", "avg": "7.0"}, {"@id": "109", "text": "If you use the Twitter API or Twitter Content in your official\ncapacity as an employee or representative of a U.S., state or local\ngovernment entity and you are legally unable to accept the indemnity,\njurisdiction, venue or other clauses herein, then those clauses do not\napply to such entity, but only to the extent as required by applicable law.", "avg": "4.71"}, {"@id": "110", "text": "For the purpose of this provision, contractor/manufacturer is Twitter,\nInc., 1355 Market Street, Suite 900, San Francisco, California 94103.", "avg": "5.43"}, {"@id": "111", "text": "C. Compliance with Laws; Export and Import.", "avg": "5.5"}, {"@id": "112", "text": "Each party will comply with all\napplicable foreign, federal, state, and local laws, rules and regulations,\nincluding without limitation, all applicable laws relating to bribery and/\nor corruption.", "avg": "5.85"}, {"@id": "113", "text": "The Licensed Material is subject to U.S. export laws and may\nbe subject to import and use laws of the country where it is delivered or\nused.", "avg": "4.19"}, {"@id": "114", "text": "You agree to abide by these laws.", "avg": "3.71"}, {"@id": "115", "text": "Under these laws, the Licensed\nMaterial may not be sold, leased, downloaded, moved, exported, re-exported,\nor transferred across borders without a license, or approval from the\nrelevant government authority, to any country or to any foreign national\nrestricted by these laws, including countries embargoed by the U.S.\nGovernment (currently Cuba, Iran, North Korea, Northern Sudan and Syria);\nor to any restricted or denied end-user including, but not limited to, any\nperson or entity prohibited by the U.S. Office of Foreign Assets Control;\nor for any restricted end-use.", "avg": "5.26"}, {"@id": "116", "text": "You will maintain throughout the Term all\nrights and licenses that are required with respect to your Services.", "avg": "5.11"}, {"@id": "117", "text": "D. Warranty Disclaimer.", "avg": "9.0"}, {"@id": "118", "text": "THE LICENSED MATERIAL IS PROVIDED TO YOU “AS IS”,\n“WHERE IS”, WITH ALL FAULTS AND EACH PARTY DISCLAIMS ALL WARRANTIES,\nWHETHER EXPRESS, IMPLIED, STATUTORY, OR OTHERWISE, INCLUDING WITHOUT\nLIMITATION WARRANTIES OF MERCHANTABILITY, NONINFRINGEMENT, FITNESS FOR A\nPARTICULAR PURPOSE, AND ANY WARRANTIES OR CONDITIONS ARISING OUT OF THIS\nAGREEMENT, COURSE OF DEALING OR USAGE OF TRADE.", "avg": "5.65"}, {"@id": "119", "text": "TWITTER DOES NOT WARRANT\nTHAT THE LICENSED MATERIAL OR ANY OTHER TWITTER PRODUCT OR SERVICE PROVIDED\nHEREUNDER WILL MEET ANY OF YOUR REQUIREMENTS OR THAT USE OF SUCH LICENSED\nMATERIAL OR OTHER PRODUCTS OR SERVICES WILL BE ERROR-FREE, UNINTERRUPTED,\nVIRUS-FREE OR SECURE.", "avg": "5.15"}, {"@id": "120", "text": "THIS DISCLAIMER OF WARRANTY MAY NOT BE VALID IN SOME\nJURISDICTIONS AND YOU MAY HAVE WARRANTY RIGHTS UNDER LAW WHICH MAY NOT BE\nWAIVED OR DISCLAIMED.", "avg": "4.69"}, {"@id": "121", "text": "ANY SUCH WARRANTY EXTENDS ONLY FOR THIRTY (30) DAYS\nFROM THE EFFECTIVE DATE OF THIS AGREEMENT (UNLESS SUCH LAW PROVIDES\nOTHERWISE).", "avg": "5.2"}, {"@id": "122", "text": "E. Indemnification.", "avg": "15.0"}, {"@id": "123", "text": "You shall defend Twitter against any and all actions,\ndemands, claims and suits (including without limitation product liability\nclaims), and indemnify and hold Twitter harmless from any and all\nliabilities, damages and costs (including without limitation reasonable\nattorneys' fees) to the extent arising out of: (i) your use of the Licensed\nMaterial in any manner that is inconsistent with this Agreement; or (ii)\nthe performance, promotion, sale or distribution of your Services.", "avg": "5.44"}, {"@id": "124", "text": "In the\nevent Twitter seeks indemnification or defense from you under this\nprovision, Twitter will promptly notify you in writing of the claim(s)\nbrought against Twitter for which it seeks indemnification or defense.", "avg": "5.26"}, {"@id": "125", "text": "Twitter reserves the right, at its option and sole discretion, to assume\nfull control of the defense of claims with legal counsel of its choice.", "avg": "4.68"}, {"@id": "126", "text": "You\nmay not enter into any third party agreement, which would, in any manner\nwhatsoever, affect the rights of Twitter, constitute an admission of fault\nby Twitter or bind Twitter in any manner, without the prior written consent\nof Twitter.", "avg": "4.85"}, {"@id": "127", "text": "In the event Twitter assumes control of the defense of such\nclaim, Twitter shall not settle any such claim requiring payment from you\nwithout your prior written approval.", "avg": "5.04"}, {"@id": "128", "text": "F. Limitation of Liability.", "avg": "7.0"}, {"@id": "129", "text": "IN NO EVENT WILL TWITTER BE LIABLE TO YOU OR ANY\nEND USERS FOR ANY INDIRECT, SPECIAL, INCIDENTAL, EXEMPLARY, PUNITIVE OR\nCONSEQUENTIAL DAMAGES OR ANY LOSS OF OR DAMAGE TO USE, DATA, BUSINESS,\nGOODWILL OR PROFITS ARISING OUT OF OR IN CONNECTION WITH THIS AGREEMENT.", "avg": "4.71"}, {"@id": "130", "text": "IN\nANY CASE, TWITTER'S AGGREGATE LIABILITY FOR ANY AND ALL CLAIMS UNDER THIS\nAGREEMENT WILL NOT EXCEED $50.00 USD.", "avg": "4.78"}, {"@id": "131", "text": "THE FOREGOING LIMITATIONS, EXCLUSIONS\nAND DISCLAIMERS SHALL APPLY REGARDLESS OF WHETHER SUCH LIABILITY ARISES\nFROM ANY CLAIM BASED UPON CONTRACT, WARRANTY, TORT (INCLUDING NEGLIGENCE),\nSTRICT LIABILITY OR OTHERWISE, AND WHETHER OR NOT THE PARTY HAS BEEN\nADVISED OF THE POSSIBILITY OF SUCH LOSS OR DAMAGE.", "avg": "5.6"}, {"@id": "132", "text": "INSOFAR AS APPLICABLE\nLAW PROHIBITS ANY LIMITATION ON LIABILITY HEREIN, THE PARTIES AGREE THAT\nSUCH LIMITATION WILL BE AUTOMATICALLY MODIFIED, BUT ONLY TO THE EXTENT SO\nAS TO MAKE THE LIMITATION COMPLIANT WITH APPLICABLE LAW.", "avg": "5.37"}, {"@id": "133", "text": "THE PARTIES AGREE\nTHAT THE LIMITATIONS ON LIABILITIES SET FORTH HEREIN ARE AGREED ALLOCATIONS\nOF RISK AND SUCH LIMITATIONS WILL APPLY NOTWITHSTANDING THE FAILURE OF\nESSENTIAL PURPOSE OF ANY LIMITED REMEDY.", "avg": "5.61"}, {"@id": "134", "text": "G. Updates.", "avg": "7.0"}, {"@id": "135", "text": "Twitter may update or modify this Agreement, Developer Terms, and\nother terms and conditions, from time to time at its sole discretion by\nposting the changes on this site or by otherwise notifying you (such notice\nmay be via email).", "avg": "4.67"}, {"@id": "136", "text": "You acknowledge that these updates and modifications may\nadversely affect how your Service accesses or communicates with the Twitter\nAPI.", "avg": "5.85"}, {"@id": "137", "text": "If any change is unacceptable to you, your only recourse is to cease\nall use of the Licensed Material.", "avg": "4.32"}, {"@id": "138", "text": "Your continued access or use of the\nLicensed Material will constitute binding acceptance of the such updates\nand modifications.", "avg": "5.68"}, {"@id": "139", "text": "H. Miscellaneous.", "avg": "13.0"}, {"@id": "140", "text": "This Agreement constitutes the entire agreement among the\nparties with respect to the subject matter and supersedes and merges all\nprior proposals, understandings and contemporaneous communications.", "avg": "6.58"}, {"@id": "141", "text": "Any\nmodification to this Agreement must be in a writing signed by both you and\nTwitter, Inc. You may not assign any of the rights or obligations granted\nhereunder, in whole or in part, whether voluntarily or by operation of law,\ncontract, merger (whether you are the surviving or disappearing entity),\nstock or asset sale, consolidation, dissolution, through government action\nor otherwise, except with the prior written consent of Twitter, Inc.\nTwitter, Inc. is authorized to sign modifications and consents on behalf of\nTwitter International Company, an Irish company responsible for the\ninformation of Twitter users who live outside the United States.", "avg": "5.3"}, {"@id": "142", "text": "Any\nattempted assignment in violation of this paragraph is null and void, and\nTwitter may terminate this Agreement.", "avg": "5.33"}, {"@id": "143", "text": "This Agreement does not create or\nimply any partnership, agency or joint venture.", "avg": "5.15"}, {"@id": "144", "text": "This Agreement will be\ngoverned by and construed in accordance with the laws of the State of\nCalifornia, without regard to or application of conflicts of law rules or\nprinciples.", "avg": "4.9"}, {"@id": "145", "text": "Any dispute, claim or controversy arising out of or relating to\nthis Agreement or the breach, termination, enforcement, interpretation or\nvalidity thereof, including the determination of the scope or applicability\nof this Agreement to arbitrate, shall be determined by arbitration in San\nFrancisco, CA before a single arbitrator.", "avg": "5.71"}, {"@id": "146", "text": "The arbitration shall be\nadministered by JAMS pursuant to its Comprehensive Arbitration Rules and\nProcedures.", "avg": "6.27"}, {"@id": "147", "text": "Judgment on the Award may be entered in any court having\njurisdiction.", "avg": "4.83"}, {"@id": "148", "text": "You and Twitter hereby expressly waive trial by jury.", "avg": "4.89"}, {"@id": "149", "text": "As an\nalternative, you may bring your claim in your local \"small claims\" court,\nif permitted by that small claims court's rules.", "avg": "4.55"}, {"@id": "150", "text": "You may bring claims only\non your own behalf, and unless Twitter agrees, the arbitrator may not\nconsolidate more than one person's claims.", "avg": "4.83"}, {"@id": "151", "text": "Despite the foregoing, you agree\nthat money damages would be an inadequate remedy for Twitter in the event\nof a breach or threatened breach of a provision of this Agreement\nprotecting Twitter's intellectual property or Confidential Information, and\nthat in the event of such a breach or threat, Twitter, in addition to any\nother remedies to which it is entitled, is entitled to such preliminary or\ninjunctive relief (including an order prohibiting Company from taking\nactions in breach of such provisions), without the need for posting bond,\nand specific performance as may be appropriate.", "avg": "5.15"}, {"@id": "152", "text": "The parties agree that\nneither the United Nations Convention on Contracts for the International\nSale of Goods, nor the Uniform Computer Information Transaction Act (UCITA)\nshall apply to this Agreement, regardless of the states in which the\nparties do business or are incorporated.", "avg": "5.44"}, {"@id": "153", "text": "No waiver by Twitter of any\ncovenant or right under this Agreement will be effective unless\nmemorialized in a writing duly authorized by Twitter.", "avg": "5.04"}, {"@id": "154", "text": "If any part of this\nAgreement is determined to be invalid or unenforceable by a court of\ncompetent jurisdiction, that provision will be enforced to the maximum\nextent permissible and the remaining provisions of this Agreement will\nremain in full force and effect.", "avg": "5.09"}, {"@id": "155", "text": "Developer Policy¶\n\nEffective: November 3, 2017.", "avg": "8.67"}, {"@id": "156", "text": "In addition to the Developer Agreement, this Developer Policy (“Policy”)\nprovides rules and guidelines for developers who interact with Twitter’s\necosystem of applications, services, website, web pages and content including\nany content that we may make available through our other covered services set\nforth at https://support.twitter.com/articles/20172501 (“Twitter Services”).", "avg": "5.65"}, {"@id": "157", "text": "Policy violations are also considered violations of the Developer Agreement.", "avg": "6.6"}, {"@id": "158", "text": "Take a look at the Definitions for the meaning of capitalized words used in\nthis Policy.", "avg": "4.5"}, {"@id": "159", "text": "These policies may be changed from time to time without notice.", "avg": "4.73"}, {"@id": "160", "text": "Please check here for any updates.", "avg": "4.67"}, {"@id": "161", "text": "• I.", "avg": "1.0"}, {"@id": "162", "text": "Guiding Principles\n  □ A.", "avg": "6.0"}, {"@id": "163", "text": "A Few Key Points\n  □ B.", "avg": "2.8"}, {"@id": "164", "text": "Maintain the Integrity of Twitter’s Products\n  □ C. Respect Users’ Control and Privacy\n  □ D. Clearly Identify Your Service\n  □ E. Keep Twitter Spam Free\n  □ F. Be a Good Partner to Twitter\n  □ G. Avoid Replicating the Core Twitter Experience\n  □ H. Engage in Appropriate Commercial Use\n  • II.", "avg": "5.5"}, {"@id": "165", "text": "Rules for Specific Twitter Services or Features\n  □ A. Twitter Login\n  □ B.", "avg": "5.4"}, {"@id": "166", "text": "Social Updates\n  □ C. Twitter Identity\n  □ D. Twitter Cards\n  □ E. Twitter for Websites\n  □ F. Periscope Producer\n  □ G. Definitions\n\nI.", "avg": "6.69"}, {"@id": "167", "text": "Guiding Principles¶\n\nA.", "avg": "4.0"}, {"@id": "168", "text": "A Few Key Points¶\n\n 1.", "avg": "2.33"}, {"@id": "169", "text": "Keep any API keys or other access credentials private and use only as\npermitted.", "avg": "4.71"}, {"@id": "170", "text": "2.", "avg": "0"}, {"@id": "171", "text": "Respect our requirements on how to display and interact with users’\ncontent.", "avg": "5.25"}, {"@id": "172", "text": "3.", "avg": "0"}, {"@id": "173", "text": "If your application will need more than 1 million user tokens, you must\ncontact us about your Twitter API access, as you may be subject to\nadditional terms.", "avg": "4.63"}, {"@id": "174", "text": "4.", "avg": "0"}, {"@id": "175", "text": "Twitter may monitor your use of the Twitter API to improve the Twitter\nServices, examine commercial use and ensure your compliance with this\nPolicy.", "avg": "5.12"}, {"@id": "176", "text": "5.", "avg": "0"}, {"@id": "177", "text": "Remember, Twitter may suspend or revoke access to the Twitter API if we\nbelieve you are in violation of this Policy.", "avg": "4.48"}, {"@id": "178", "text": "Do not apply for or register\nadditional API tokens if Twitter has suspended your account.", "avg": "4.93"}, {"@id": "179", "text": "Instead,\ncontact us.", "avg": "5.33"}, {"@id": "180", "text": "B.", "avg": "1.0"}, {"@id": "181", "text": "Maintain the Integrity of Twitter’s Products¶\n\n 1.", "avg": "5.0"}, {"@id": "182", "text": "Follow the Display Requirements, Twitter Rules and Periscope Community\nGuidelines.", "avg": "7.1"}, {"@id": "183", "text": "If your Service facilitates or induces users to violate the\nTwitter Rules or Periscope Community Guidelines, you must figure out how to\nprevent the abuse or Twitter may suspend or terminate your access to the\nTwitter API.", "avg": "4.95"}, {"@id": "184", "text": "We’ve provided guidance in our Abuse Prevention and Security\nhelp page.", "avg": "4.92"}, {"@id": "185", "text": "2.", "avg": "0"}, {"@id": "186", "text": "If your Service submits content to Twitter that includes a Twitter\nusername, submit the correct Twitter username (“@username”).", "avg": "5.72"}, {"@id": "187", "text": "3.", "avg": "0"}, {"@id": "188", "text": "Do not modify, translate or delete a portion of the Content.", "avg": "4.36"}, {"@id": "189", "text": "4.", "avg": "0"}, {"@id": "190", "text": "Maintain the features and functionality of Content and Twitter API.", "avg": "5.7"}, {"@id": "191", "text": "Do not\ninterfere with, intercept, disrupt, filter, or disable any features of\nTwitter or the Twitter API, including the Content of embedded Tweets and\nembedded timelines.", "avg": "5.35"}, {"@id": "192", "text": "5.", "avg": "0"}, {"@id": "193", "text": "Do not exceed or circumvent limitations on access, calls, sharing, privacy\nsettings, or use permitted in this Policy, or as otherwise set forth on the\nDeveloper Site, or communicated to you by Twitter.", "avg": "4.91"}, {"@id": "194", "text": "6.", "avg": "0"}, {"@id": "195", "text": "Do not remove or alter any proprietary notices or marks on Content or the\nTwitter API.", "avg": "4.38"}, {"@id": "196", "text": "7.", "avg": "0"}, {"@id": "197", "text": "Do not (and do not allow others to) aggregate, cache, or store location\ndata and other geographic information contained in the Content, except as\npart of a Tweet or Periscope Broadcast.", "avg": "4.81"}, {"@id": "198", "text": "Any use of location data or\ngeographic information on a standalone basis is prohibited.", "avg": "5.21"}, {"@id": "199", "text": "C. Respect Users’ Control and Privacy¶\n\n 1.", "avg": "5.5"}, {"@id": "200", "text": "Get the user’s express consent before you do any of the following:\n a.", "avg": "3.86"}, {"@id": "201", "text": "Take any actions on a user’s behalf, including posting Content,\nfollowing/unfollowing other users, modifying profile information,\nstarting a Periscope Broadcast or adding hashtags or other data to the\nuser's Tweets.", "avg": "5.23"}, {"@id": "202", "text": "A user authenticating through your Service does not\nconstitute user consent.", "avg": "5.91"}, {"@id": "203", "text": "b. Republish Content accessed by means other than via the Twitter API or\nother Twitter tools.", "avg": "5.0"}, {"@id": "204", "text": "c. Use a user’s Content to promote a commercial product or service, either\non a commercial durable good or as part of an advertisement.", "avg": "4.46"}, {"@id": "205", "text": "d. Store non-public Content such as Direct Messages or other private or\nconfidential information.", "avg": "5.92"}, {"@id": "206", "text": "e. Share or publish protected Content, private or confidential\ninformation.", "avg": "6.89"}, {"@id": "207", "text": "f. Configure media to be sent in a Direct Message as \"shared\" (i.e.", "avg": "4.18"}, {"@id": "208", "text": "reusable across multiple Direct Messages).", "avg": "7.2"}, {"@id": "209", "text": "You must also provide the\nuser with clear notice that \"shared\" media sent in a Direct Message\nwill be viewable by anyone with the media's URL.", "avg": "4.31"}, {"@id": "210", "text": "2.", "avg": "0"}, {"@id": "211", "text": "Do not (and do not permit others to) associate the Content with any person,\nhousehold, device, browser, or other individual identifier, unless you or\nthe entity on whose sole behalf you make such an association do so (a) with\nthe express opt-in consent of the applicable individual; or (b) based\nsolely on publicly available data and/or data provided directly by the\napplicable individual that the individual would reasonably expect to be\nused for that purpose.", "avg": "4.96"}, {"@id": "212", "text": "3.", "avg": "0"}, {"@id": "213", "text": "If Content is deleted, gains protected status, or is otherwise suspended,\nwithheld, modified, or removed from the Twitter Service (including removal\nof location information), you will make all reasonable efforts to delete or\nmodify such Content (as applicable) as soon as reasonably possible, and in\nany case within 24 hours after a request to do so by Twitter or by a\nTwitter user with regard to their Content, unless otherwise prohibited by\napplicable law or regulation, and with the express written permission of\nTwitter.", "avg": "5.12"}, {"@id": "214", "text": "4.", "avg": "0"}, {"@id": "215", "text": "If your Service will display Content to the public or to end users of your\nService, and you do not use Twitter Kit or Twitter for Websites to do so,\nthen you must use the Twitter API to retrieve the most current version of\nthe Content for such display.", "avg": "4.1"}, {"@id": "216", "text": "If Content ceases to be available through the\nTwitter API, you may not display such Content and must remove it from\nnon-display portions of your Service as soon as reasonably possible.", "avg": "4.7"}, {"@id": "217", "text": "5.", "avg": "0"}, {"@id": "218", "text": "If your Service allows users to post Content to Twitter, then, before\npublishing, show the user exactly what will be published, including whether\nany geotags will be added to the Content.", "avg": "4.9"}, {"@id": "219", "text": "If you will send read receipt\nevents for Direct Messages, you should inform users they will be sent as\npart of a conversation, such as by directly providing this notice to users\nin your application or by displaying read receipts from other participants\nin a conversation.", "avg": "4.85"}, {"@id": "220", "text": "6.", "avg": "0"}, {"@id": "221", "text": "If your Service allows users to post Content to your Service and Twitter,\nthen, before publishing to the Service:\n a.", "avg": "4.65"}, {"@id": "222", "text": "Explain how you will use the Content;\n b.", "avg": "3.88"}, {"@id": "223", "text": "Obtain proper permission to use the Content; and\n c. Continue to use such Content in accordance with this Policy in\nconnection with the Content.", "avg": "5.04"}, {"@id": "224", "text": "7.", "avg": "0"}, {"@id": "225", "text": "Display your Service’s privacy policy to users before download,\ninstallation or sign up of your application.", "avg": "5.29"}, {"@id": "226", "text": "Your privacy policy must be\nconsistent with all applicable laws, and be no less protective of end users\nthan Twitter’s Privacy Policy located at https://twitter.com/privacy\nincluding any relevant incorporated policies such as the supplemental terms\nlocated at https://support.twitter.com/articles/20172501.", "avg": "5.23"}, {"@id": "227", "text": "You must comply\nwith your privacy policy, which must clearly disclose the information you\ncollect from users, how you use and share that information (including with\nTwitter), and how users can contact you with inquiries and requests\nregarding their information.", "avg": "5.4"}, {"@id": "228", "text": "If for any reason you are unable to comply\nwith your privacy policy or any privacy requirement of the Developer\nAgreement or Policy, you must promptly inform Twitter and take reasonable\nand appropriate steps to remedy any non-compliance, or cease your access to\nthe Twitter API and use of all Twitter Content.", "avg": "4.73"}, {"@id": "229", "text": "8.", "avg": "0"}, {"@id": "230", "text": "If your Service uses cookies, disclose in your privacy policy:\n a.", "avg": "4.73"}, {"@id": "231", "text": "Whether third parties collect user information on your Service and\nacross other websites or online services;\n b.", "avg": "5.47"}, {"@id": "232", "text": "Information about user options for cookie management and whether you\nhonor the Do Not Track setting in supporting web browsers.", "avg": "5.35"}, {"@id": "233", "text": "9.", "avg": "0"}, {"@id": "234", "text": "If your Service adds location information to users’ Tweets or Periscope\nBroadcasts:\n a.", "avg": "5.46"}, {"@id": "235", "text": "Disclose when you add location information, whether as a geotag or\nannotations data, and whether you add a place or specific coordinates.", "avg": "5.14"}, {"@id": "236", "text": "b.", "avg": "1.0"}, {"@id": "237", "text": "Comply with Geo Developers Guidelines if your application allows users\nto Tweet with their location.", "avg": "5.67"}, {"@id": "238", "text": "10.", "avg": "0"}, {"@id": "239", "text": "Do not store Twitter passwords.", "avg": "5.2"}, {"@id": "240", "text": "D. Clearly Identify Your Service¶\n\n 1.", "avg": "6.33"}, {"@id": "241", "text": "Make sure users understand your identity and the source and purpose of your\nService.", "avg": "5.0"}, {"@id": "242", "text": "For example:\n a. Don’t use a name or logo that falsely implies you or your company is\nrelated to another business or person.", "avg": "4.17"}, {"@id": "243", "text": "b. Don’t use a shortened URL for your Service that attempts to mask the\ndestination site.", "avg": "4.38"}, {"@id": "244", "text": "c. Don’t use a URL for your Service that directs users to\n i. a site that is unrelated to your Service\nii.", "avg": "3.71"}, {"@id": "245", "text": "a site that encourages users to violate the Twitter Rules or the\nPeriscope Community Guidelines.", "avg": "5.4"}, {"@id": "246", "text": "iii.", "avg": "3.0"}, {"@id": "247", "text": "a spam or malware site.", "avg": "3.6"}, {"@id": "248", "text": "2.", "avg": "0"}, {"@id": "249", "text": "Do not replicate, frame, or mirror the Twitter website or its design.", "avg": "4.58"}, {"@id": "250", "text": "E. Keep Twitter Spam Free¶\n\n 1.", "avg": "5.0"}, {"@id": "251", "text": "Follow the Abuse and Spam rules here.", "avg": "4.29"}, {"@id": "252", "text": "2.", "avg": "0"}, {"@id": "253", "text": "Comply with the automation rules if your Service performs automatic\nactions.", "avg": "5.91"}, {"@id": "254", "text": "3.", "avg": "0"}, {"@id": "255", "text": "Do not do any of the following:\n a. Mass-register applications.", "avg": "4.5"}, {"@id": "256", "text": "b.", "avg": "1.0"}, {"@id": "257", "text": "Create tokens/applications to sell names, prevent others from using\nnames, or other commercial use.", "avg": "4.92"}, {"@id": "258", "text": "c. Use third-party content feeds to update and maintain accounts under\nthose third parties’ names.", "avg": "5.31"}, {"@id": "259", "text": "d. Name squat by submitting multiple applications with the same function\nunder different names.", "avg": "6.08"}, {"@id": "260", "text": "e. Publish links to malicious content.", "avg": "6.0"}, {"@id": "261", "text": "f. Publish pornographic or obscene images to user profile images and\nbackground images.", "avg": "6.0"}, {"@id": "262", "text": "F. Be a Good Partner to Twitter¶\n\n 1.", "avg": "3.2"}, {"@id": "263", "text": "Follow the guidelines for using Tweets in broadcast if you display Tweets\noffline and the guidelines for using Periscope Broadcasts in a broadcast if\nyou display Periscope Broadcasts offline.", "avg": "5.59"}, {"@id": "264", "text": "2.", "avg": "0"}, {"@id": "265", "text": "If you provide Content to third parties, including downloadable datasets of\nContent or an API that returns Content, you will only distribute or allow\ndownload of Tweet IDs, Direct Message IDs, and/or User IDs.", "avg": "5.0"}, {"@id": "266", "text": "a.", "avg": "1.0"}, {"@id": "267", "text": "You may, however, provide export via non-automated means (e.g.,\ndownload of spreadsheets or PDF files, or use of a “save as” button) of\nup to 50,000 public Tweet Objects and/or User Objects per user of your\nService, per day.", "avg": "4.2"}, {"@id": "268", "text": "b.", "avg": "1.0"}, {"@id": "269", "text": "Any Content provided to third parties remains subject to this Policy,\nand those third parties must agree to the Twitter Terms of Service,\nPrivacy Policy, Developer Agreement, and Developer Policy before\nreceiving such downloads.", "avg": "5.59"}, {"@id": "270", "text": "i.", "avg": "1.0"}, {"@id": "271", "text": "You may not distribute more than 1,500,000 Tweet IDs to any entity\n(inclusive of multiple individual users associated with a single\nentity) within any given 30 day period, unless you are doing so on\nbehalf of an academic institution and for the sole purpose of\nnon-commercial research or you have received the express written\npermission of Twitter.", "avg": "4.87"}, {"@id": "272", "text": "ii.", "avg": "2.0"}, {"@id": "273", "text": "You may not distribute Tweet IDs for the purposes of (a) enabling\nany entity to store and analyze Tweets for a period exceeding 30\ndays unless you are doing so on behalf of an academic institution\nand for the sole purpose of non-commercial research or you have\nreceived the express written permission of Twitter, or (b) enabling\nany entity to circumvent any other limitations or restrictions on\nthe distribution of Twitter Content as contained in this Policy,\nthe Twitter Developer Agreement, or any other agreement with\nTwitter.", "avg": "4.93"}, {"@id": "274", "text": "3.", "avg": "0"}, {"@id": "275", "text": "Use and display Twitter Marks solely to identify Twitter as the source of\nContent.", "avg": "4.86"}, {"@id": "276", "text": "4.", "avg": "0"}, {"@id": "277", "text": "Comply with Twitter Brand Assets and Guidelines as well as the Periscope\nTrademark guidelines.", "avg": "5.71"}, {"@id": "278", "text": "5.", "avg": "0"}, {"@id": "279", "text": "Do not do any of the following:\n a.", "avg": "3.12"}, {"@id": "280", "text": "Use a single application API key for multiple use cases or multiple\napplication API keys for the same use case.", "avg": "4.55"}, {"@id": "281", "text": "b.", "avg": "1.0"}, {"@id": "282", "text": "Charge a premium above your Service's standard data and usage rates for\naccess to Content via SMS or USSD.", "avg": "4.47"}, {"@id": "283", "text": "c. Sell or receive monetary or virtual compensation for Tweet actions,\nPeriscope Broadcasts actions or the placement of Tweet actions on your\nService, such as, but not limited to follow, retweet, like, heart,\ncomment and reply.", "avg": "5.2"}, {"@id": "284", "text": "d. Do not use, access or analyze the Twitter API to monitor or measure the\navailability, performance, functionality, usage statistics or results\nof Twitter Services or for any other benchmarking or competitive\npurposes, including without limitation, monitoring or measuring:\n i. the responsiveness of Twitter Services; or\nii.", "avg": "5.89"}, {"@id": "285", "text": "aggregate Twitter user metrics such as total number of active\nusers, accounts, total number of Periscope Broadcast views, user\nengagements or account engagements.", "avg": "5.91"}, {"@id": "286", "text": "e. Use Twitter Content, by itself or bundled with third party data, to\ntarget users with advertising outside of the Twitter platform,\nincluding without limitation on other advertising networks, via data\nbrokers, or through any other advertising or monetization services.", "avg": "5.72"}, {"@id": "287", "text": "f. Use Twitter Marks, or Twitter Certified Products Program badges, or\nsimilar marks or names in a manner that creates a false sense of\nendorsement, sponsorship, or association with Twitter.", "avg": "5.31"}, {"@id": "288", "text": "g. Use the Twitter Verified Account badge, Verified Account status, or any\nother enhanced user categorization on Twitter Content other than that\nreported to you by Twitter through the API.", "avg": "5.31"}, {"@id": "289", "text": "G. Avoid Replicating the Core Twitter Experience¶\n\n 1.", "avg": "6.0"}, {"@id": "290", "text": "Twitter discourages online services from replicating Twitter Service’s core\nuser experience or features.", "avg": "6.43"}, {"@id": "291", "text": "2.", "avg": "0"}, {"@id": "292", "text": "The following rules apply solely to Services or applications that attempt\nto replicate Twitter’s core user experience:\n a.", "avg": "5.32"}, {"@id": "293", "text": "You must obtain our permission to have more than 100,000 user tokens,\nand you may be subject to additional terms.", "avg": "4.47"}, {"@id": "294", "text": "b.", "avg": "1.0"}, {"@id": "295", "text": "Use the Twitter API as provided by Twitter for functionalities in your\nService that are substantially similar to a Twitter Service feature and\npresent this to your users as the default option.", "avg": "5.0"}, {"@id": "296", "text": "c. Display a prominent link or button in your Service that directs new\nusers to Twitter’s sign-up functionality.", "avg": "4.94"}, {"@id": "297", "text": "d. Do not do the following:\n i.", "avg": "3.33"}, {"@id": "298", "text": "Pay, or offer to pay, third parties for distribution.", "avg": "4.67"}, {"@id": "299", "text": "This includes\noffering compensation for downloads (other than transactional fees)\nor other mechanisms of traffic acquisition.", "avg": "6.69"}, {"@id": "300", "text": "ii.", "avg": "2.0"}, {"@id": "301", "text": "Arrange for your Service to be pre-installed on any other device,\npromoted as a \"zero-rated\" service, or marketed as part of a\nspecialized data plan.", "avg": "4.22"}, {"@id": "302", "text": "iii.", "avg": "3.0"}, {"@id": "303", "text": "Use Twitter Content or other data collected from users to create\nor maintain a separate status update, social network, private\nmessaging or live broadcasting database or service.", "avg": "5.52"}, {"@id": "304", "text": "H. Engage in Appropriate Commercial Use¶\n\n 1.", "avg": "7.25"}, {"@id": "305", "text": "Advertising Around Twitter Content\n a.", "avg": "6.4"}, {"@id": "306", "text": "You may advertise around and on sites that display Tweets and Periscope\nBroadcasts, but you may not place any advertisements within the Twitter\ntimeline or on or within Periscope Broadcasts on your Service other\nthan Twitter Ads or advertisements made available through the official\nTwitter Kit integration with MoPub.", "avg": "5.47"}, {"@id": "307", "text": "Access to MoPub ads through Twitter\nKit requires a MoPub supply account and is subject to MoPub terms of\nservice & policies.", "avg": "4.81"}, {"@id": "308", "text": "b.", "avg": "1.0"}, {"@id": "309", "text": "Your advertisements cannot resemble or reasonably be confused by users\nas a Tweet or Periscope Broadcast.", "avg": "5.24"}, {"@id": "310", "text": "c. You may advertise in close proximity to the Twitter timeline or a\nPeriscope Broadcast (e.g., banner ads above or below timeline), but\nthere must be a clear separation between Twitter content and your\nadvertisements.", "avg": "5.24"}, {"@id": "311", "text": "2.", "avg": "0"}, {"@id": "312", "text": "Twitter reserves the right to serve advertising via Twitter APIs (“Twitter\nAds”).", "avg": "5.42"}, {"@id": "313", "text": "If you decide to serve Twitter Ads once we start delivering them, we\nwill share a portion of advertising revenue with you in accordance with the\nrelevant terms and conditions.", "avg": "4.8"}, {"@id": "314", "text": "II.", "avg": "2.0"}, {"@id": "315", "text": "Rules for Specific Twitter Services or Features¶\n\nA. Twitter Login¶\n\n 1.", "avg": "5.71"}, {"@id": "316", "text": "Present users with easy to find options to log into and out of Twitter, for\nexample, via the OAuth protocol or Twitter Kit.", "avg": "4.26"}, {"@id": "317", "text": "2.", "avg": "0"}, {"@id": "318", "text": "Provide users without a Twitter account the opportunity to create a new\nTwitter account.", "avg": "5.29"}, {"@id": "319", "text": "3.", "avg": "0"}, {"@id": "320", "text": "Display the \"Sign in with Twitter\" option at least as prominently as the\nmost prominent of any other third party social networking sign-up or\nsign-in marks and branding appearing on your Service.", "avg": "4.9"}, {"@id": "321", "text": "B.", "avg": "1.0"}, {"@id": "322", "text": "Social Updates¶\n\n 1.", "avg": "6.0"}, {"@id": "323", "text": "If you allow users to create social updates from your own social service or\na third party social networking, micro-blogging, or status update provider\nintegrated into your Service (\"Update\"), you must display a prominent\noption to publish that content to Twitter.", "avg": "5.03"}, {"@id": "324", "text": "2.", "avg": "0"}, {"@id": "325", "text": "If Updates are longer than 140 characters or not text, you must display a\nprominent link to publish that content to Twitter and:\n a. URLs must direct users to the page where that content is displayed.", "avg": "4.59"}, {"@id": "326", "text": "You\nmay require users to sign in to access that page, but the content must\nnot otherwise be restricted from being viewed.", "avg": "4.45"}, {"@id": "327", "text": "b. URLs must not direct users to interstitial or intermediate pages.", "avg": "5.5"}, {"@id": "328", "text": "C. Twitter Identity¶\n\n 1.", "avg": "7.0"}, {"@id": "329", "text": "Once a user has authenticated via \"Sign in with Twitter\" via your Service,\nyou must clearly display the user's Twitter identity via your Service.", "avg": "4.83"}, {"@id": "330", "text": "Twitter identity includes visible display of the user's avatar, Twitter\nuser name and the Twitter bird mark.", "avg": "5.18"}, {"@id": "331", "text": "2.", "avg": "0"}, {"@id": "332", "text": "Displays of the user's followers on your Service must clearly show that the\nrelationship is associated with the Twitter Service.", "avg": "5.3"}, {"@id": "333", "text": "D. Twitter Cards¶\n\n 1.", "avg": "7.0"}, {"@id": "334", "text": "Develop your Card to have the same quality experience across all platforms\nwhere Cards are displayed.", "avg": "5.31"}, {"@id": "335", "text": "2.", "avg": "0"}, {"@id": "336", "text": "If your Service provides a logged-in experience, the experience prior to a\nuser’s login must be of equivalent quality and user value.", "avg": "4.55"}, {"@id": "337", "text": "3.", "avg": "0"}, {"@id": "338", "text": "Mark your Card as ‘true’ for sensitive media if such media can be\ndisplayed.", "avg": "4.29"}, {"@id": "339", "text": "4.", "avg": "0"}, {"@id": "340", "text": "Use HTTPS for hosting all assets within your Card.", "avg": "4.56"}, {"@id": "341", "text": "5.", "avg": "0"}, {"@id": "342", "text": "For video and audio content:\n a.", "avg": "4.0"}, {"@id": "343", "text": "Default to ‘sound off’ for videos that automatically play content.", "avg": "5.4"}, {"@id": "344", "text": "b.", "avg": "1.0"}, {"@id": "345", "text": "Include stop or pause controls.", "avg": "5.2"}, {"@id": "346", "text": "6.", "avg": "0"}, {"@id": "347", "text": "Do not do any of the following:\n a.", "avg": "3.12"}, {"@id": "348", "text": "Exceed or circumvent Twitter’s limitations placed on any Cards,\nincluding the Card’s intended use.", "avg": "5.06"}, {"@id": "349", "text": "b.", "avg": "1.0"}, {"@id": "350", "text": "Attach the App Card to a user’s Tweet, unless the user is explicitly\npromoting or referring to the app in the Tweet.", "avg": "4.0"}, {"@id": "351", "text": "c. Place third-party sponsored content within Cards without Twitter’s\nprior approval.", "avg": "6.0"}, {"@id": "352", "text": "d. Include content or actions within your Card that are not contextually\nrelevant to the user’s Tweet text and Tweet entities, such as URLs and\nmedia.", "avg": "4.62"}, {"@id": "353", "text": "e. Generate active mixed content browser warnings.", "avg": "6.83"}, {"@id": "354", "text": "f. Attach monetary incentives or transactions (including virtual currency)\nto activities that occur within the Card or on Twitter from your Card.", "avg": "5.67"}, {"@id": "355", "text": "g. Apply for Cards access for domains you do not manage to prevent others\nfrom registering or utilizing Cards on those domains.", "avg": "4.9"}, {"@id": "356", "text": "E. Twitter for Websites¶\n\n 1.", "avg": "5.0"}, {"@id": "357", "text": "If you expect your embedded Tweets and embedded timelines to exceed 10\nmillion daily impressions, you must contact us about your Twitter API\naccess, as you may be subject to additional terms.", "avg": "5.0"}, {"@id": "358", "text": "2.", "avg": "0"}, {"@id": "359", "text": "If you use Twitter for Websites widgets, you must ensure that an end user\nis provided with clear and comprehensive information about, and consents\nto, the storing and accessing of cookies or other information on the end\nuser’s device as described in Twitter's cookie use where providing such\ninformation and obtaining such consent is required by law.", "avg": "4.95"}, {"@id": "360", "text": "3.", "avg": "0"}, {"@id": "361", "text": "If you use embedded Tweets or embedded timelines, you must provide users\nlegally sufficient notice that fully discloses Twitter's collection and use\nof data about users’ browsing activities on your website, including for\ninterest-based advertising and personalization.", "avg": "5.89"}, {"@id": "362", "text": "You must also obtain\nlegally sufficient consent from users for such collection and use, and\nprovide legally sufficient instructions on how users can opt out of\nTwitter’s interest-based advertising and personalization as described here.", "avg": "5.44"}, {"@id": "363", "text": "4.", "avg": "0"}, {"@id": "364", "text": "If you operate a Service targeted to children under 13, you must opt out of\ntailoring Twitter in any embedded Tweets or embedded timelines on your\nService by setting the opt-out parameter to be true as described here.", "avg": "4.69"}, {"@id": "365", "text": "F. Periscope Producer¶\n\n 1.", "avg": "9.0"}, {"@id": "366", "text": "You must provide a reasonable user-agent, as described in the Periscope\nProducer technical documentation, for your Service when accessing the\nPeriscope API.", "avg": "5.81"}, {"@id": "367", "text": "2.", "avg": "0"}, {"@id": "368", "text": "If you expect the number of broadcasts created by your hardware will exceed\n(10 million) daily broadcasts, you must contact us about your Twitter API\naccess, as you may be subject to additional terms.", "avg": "4.85"}, {"@id": "369", "text": "3.", "avg": "0"}, {"@id": "370", "text": "You must honor user requests to log out of their Periscope account on your\nService.", "avg": "4.53"}, {"@id": "371", "text": "4.", "avg": "0"}, {"@id": "372", "text": "You may not provide tools in your service to allow users to circumvent\ntechnological protection measures.", "avg": "5.56"}, {"@id": "373", "text": "G. Definitions¶\n\n 1.", "avg": "0"}, {"@id": "374", "text": "Content - Tweets, Tweet IDs, Direct Messages, Direct Message IDs, Twitter\nend user profile information, User IDs, Periscope Broadcasts, Periscope\nBroadcast IDs and any other data and information made available to you\nthrough the Twitter API or by any other means authorized by Twitter, and\nany copies and derivative works thereof.", "avg": "5.4"}, {"@id": "375", "text": "2.", "avg": "0"}, {"@id": "376", "text": "Developer Site ‒ Twitter’s developer site located at https://\ndeveloper.twitter.com.", "avg": "5.33"}, {"@id": "377", "text": "3.", "avg": "0"}, {"@id": "378", "text": "Periscope Broadcast - A user generated live video stream that is available\nlive or on-demand, that is publicly displayed on Twitter Services.", "avg": "5.4"}, {"@id": "379", "text": "4.", "avg": "0"}, {"@id": "380", "text": "Broadcast ID - A unique identification number generated for each Periscope\nBroadcast.", "avg": "6.55"}, {"@id": "381", "text": "5.", "avg": "0"}, {"@id": "382", "text": "Tweet - A short-form text and/or multimedia-based posting made on Twitter\nServices.", "avg": "4.75"}, {"@id": "383", "text": "6.", "avg": "0"}, {"@id": "384", "text": "Tweet ID - A unique identification number generated for each Tweet.", "avg": "5.5"}, {"@id": "385", "text": "7.", "avg": "0"}, {"@id": "386", "text": "Direct Message - A text and/or multimedia-based posting that is privately\nsent on the Twitter Service by one end user to one or more specific end\nuser(s).", "avg": "4.08"}, {"@id": "387", "text": "8.", "avg": "0"}, {"@id": "388", "text": "Direct Message ID - A unique identification number generated for each\nDirect Message.", "avg": "5.92"}, {"@id": "389", "text": "9.", "avg": "0"}, {"@id": "390", "text": "Twitter API - The Twitter Application Programming Interface (“API”),\nSoftware Development Kit (“SDK”) and/or the related documentation, data,\ncode, and other materials provided by Twitter, as updated from time to\ntime, including without limitation through the Developer Site.", "avg": "6.0"}, {"@id": "391", "text": "10.", "avg": "0"}, {"@id": "392", "text": "Twitter Marks - The Twitter name, or logos that Twitter makes available to\nyou, including via the Developer Site.", "avg": "5.06"}, {"@id": "393", "text": "11.", "avg": "0"}, {"@id": "394", "text": "Service - Your websites, applications, hardware and other offerings that\ndisplay or otherwise use Content.", "avg": "6.29"}, {"@id": "395", "text": "12.", "avg": "0"}, {"@id": "396", "text": "User ID - Unique identification numbers generated for each User that do not\ncontain any personally identifiable information such as Twitter usernames\nor users’ names.", "avg": "5.79"}, {"@id": "397", "text": "Developer policy and terms", "avg": "5.75"}]}}}}}
